+ **Tweets**: tweets dataset needs to be smaller;
+ **Stocks**: only TSLA, AMZN, GOOGL, AAPL and MSFT data after 2015 should be kept.

# Tweets

In [2]:
import pandas as pd

In [3]:
file1=r"datasets\tweets\Tweet.csv"
file2=r"datasets\tweets\Company_Tweet.csv"

In [4]:
test_df=pd.read_csv(file1, nrows=5)
test_df.columns

Index(['tweet_id', 'writer', 'post_date', 'body', 'comment_num', 'retweet_num',
       'like_num'],
      dtype='object')

In [5]:
test_df=pd.read_csv(file2, nrows=5)
test_df.columns

Index(['tweet_id', 'ticker_symbol'], dtype='object')

In [47]:
#chunk_size=1200000
#batch_no=0
#for chunk in pd.read_csv(file1, chunksize=chunk_size):
#    batch_no+=1
#    chunk.to_csv(r'datasets\tweets\Tweet\Tweet_' + str(batch_no) + '.csv', index=False)
#    
#print('All done!', batch_no, 'files were created.')

All done! 4 files were created.

In [24]:
#chunk_size=3000000
#batch_no=0
#for chunk in pd.read_csv(file2, chunksize=chunk_size):
#    batch_no+=1
#    chunk.to_csv(r'datasets\tweets\Company_Tweet\Company_Tweet_' + str(batch_no) + '.csv', index=False)
#    
#print('All done!', batch_no, 'files were created.')

All done! 2 files were created.

# Stocks

In [10]:
file=r"datasets/nasdaq/nasdaq_historical_prices_daily/nasdaq_historical_prices_daily.csv"

In [12]:
test_df=pd.read_csv(file, nrows=5)
test_df.columns

Index(['ticker', 'date', 'open', 'high', 'low', 'close', 'volume'], dtype='object')

In [45]:
#chunk_size=5000000
#batch_no=0
#for chunk in pd.read_csv(file, chunksize=chunk_size):
#    batch_no+=1
#    chunk.to_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_' + str(batch_no) + '.csv', 
#                 index=False)
#    
#print('All done!', batch_no, 'files were created.')

All done! 4 files were created.

In [13]:
df1=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_1.csv')
df2=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_2.csv')
df3=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_3.csv')
df4=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_4.csv')

In [46]:
# ver em que dfs estão os tickers que queremos
dfs=[df1,df2,df3,df4]
tickers=['AAPL','TSLA','MSFT','GOOGL','AMZN']
for i in range(len(dfs)):
    for ticker in tickers:
        if ticker in dfs[i]['ticker'].unique():
            print(ticker, 'df' + str(i+1))

AAPL df1
TSLA df1
MSFT df1
GOOGL df1
AMZN df1

In [ ]:
# todos os tickers estao no primeiro ficheiro (df1)

In [32]:
def ticker15(ticker, df=df1):
    '''Recebe um ticker (str) e cria um dataframe de preços de ações dessa empresa a partir de 2015'''
    ticker_list=[]
    for i in df.index:
        if df['ticker'][i]==ticker:
            ticker_list.append(i)
            
    temp_df=df.iloc[ticker_list]
    df15=temp_df[temp_df.date>'2014-12-31'].sort_values(by='date').reset_index(drop=True)
    
    return df15

In [34]:
#aapl15=ticker15('AAPL')
aapl15.head(3)

  ticker        date    open    high     low   close    volume
0   AAPL  2015-01-02  111.39  111.44  107.35  109.33  53204626
1   AAPL  2015-01-05  108.29  108.65  105.41  106.25  64285491
2   AAPL  2015-01-06  106.54  107.43  104.63  106.26  65797116

In [35]:
msft15=ticker15('MSFT')
msft15.head(3)

  ticker        date   open    high    low   close    volume
0   MSFT  2015-01-02  46.66  47.420  46.54  46.760  27913852
1   MSFT  2015-01-05  46.37  46.730  46.25  46.325  39673865
2   MSFT  2015-01-06  46.38  46.749  45.54  45.650  36447854

In [36]:
goog15=ticker15('GOOGL')
goog15.head(3)

  ticker        date    open      high     low   close   volume
0  GOOGL  2015-01-02  532.60  535.8000  527.88  529.55  1327870
1  GOOGL  2015-01-05  527.15  527.9899  517.75  519.46  2059119
2  GOOGL  2015-01-06  520.50  521.2100  505.55  506.64  2731813

In [37]:
tsla15=ticker15('TSLA')
tsla15.head(3)

  ticker        date    open    high       low   close   volume
0   TSLA  2015-01-02  222.87  223.25  213.2600  219.31  4764443
1   TSLA  2015-01-05  214.55  216.50  207.1626  210.09  5368477
2   TSLA  2015-01-06  210.06  214.20  204.2100  211.28  6261936

In [38]:
amzn15=ticker15('AMZN')
amzn15.head(3)

  ticker        date    open    high       low   close   volume
0   AMZN  2015-01-02  312.58  314.75  306.9601  308.52  2788101
1   AMZN  2015-01-05  307.01  308.38  300.8500  302.19  2774231
2   AMZN  2015-01-06  302.24  303.00  292.3800  295.29  3519034

In [40]:
top5_prices=pd.concat([aapl15,amzn15,goog15,tsla15,msft15]).sort_values(by=['ticker','date']).reset_index(drop=True)
top5_prices.head()

  ticker        date    open    high      low   close    volume
0   AAPL  2015-01-02  111.39  111.44  107.350  109.33  53204626
1   AAPL  2015-01-05  108.29  108.65  105.410  106.25  64285491
2   AAPL  2015-01-06  106.54  107.43  104.630  106.26  65797116
3   AAPL  2015-01-07  107.20  108.20  106.695  107.75  40105934
4   AAPL  2015-01-08  109.23  112.15  108.700  111.89  59364547

In [41]:
len(top5_prices)

6415

In [42]:
top5_prices.to_csv(r'datasets/nasdaq/top5_prices_v2.csv', index=False)